firstCrude2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       4700;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       4740;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       4780;
    }
    atmosphere
    {
        type            patch;
        nFaces          60;
        startFace       4840;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4800;
        startFace       4900;
    }
)

// ************************************************************************* //
